---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.SiteLinkerUIService
source: html/53745637-c352-75f7-cc20-a47a81c9d92b.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.SiteLinkerUIService Property

The external UI service which permits registration of an alternate servers for new UI of link topography

## Syntax (C#)
```csharp
public static ExternalServiceId SiteLinkerUIService { get; }
```